import { Book1, MessageQuestion } from "iconsax-react";
import Image from "next/image";
import React from "react";

const page = () => {
  return (
    <>
      <div className="container !mx-auto flex flex-col mb-10 mt-28 sm:!mt-44">
        <div className="!w-full !h-full flex !items-center !justify-center hover:!scale-115 transition delay-150 duration-300 ease-out ">
          <Image
            src="/assets/images/about-us.png"
            alt="books"
            width="400"
            height="200"
          ></Image>
        </div>
        <div className="flex !w-full flex-col gap-y-8  px-4 lg:!items-start items-center mt-10">
          <h1 className="!font-bold text-3xl !text-primary flex !justify-center !items-center gap-x-1">
            <Book1 size="32" className="!text-primary" />
            طاقچه! نزدیک ترین کتابفروشی شهر
          </h1>
          <text className="font-medium text-lg leading-[35px] !text-justify">
            طاقچه پلتفرمی است برای دسترسی قانونی به نسخهٔ دیجیتال و صوتی
            کتاب‌ها. طاقچه مانند پل ناشران و کتاب‌خوانان را به هم وصل‌ می‌کند.
            پس از آنکه ناشر برای کتاب یا مجله‌ٔ خود مجوز انتشار و شابک بگیرد،
            می‌تواند نسخهٔ الکترونیکی یا صوتی آن را از طریق طاقچه به مخاطبان خود
            برساند. پلتفرم طاقچه محصولی است از شرکت خدمات هوشمند ایدهٔ طلایی
            هاتف معاصر و شرکت نرم‌افزارهای هوشمند همراه هامون زرین.
          </text>
        </div>

        <div className="flex !w-full flex-col gap-y-8  px-4 lg:!items-start items-center mt-10">
          <h2 className="!font-bold text-3xl  !text-primary flex !justify-center !items-center gap-x-1">
            <MessageQuestion size="32" />
            در طاقچه چه می‌کنیم؟
          </h2>
          <text className="font-medium text-lg leading-[35px] !text-justify">
            در طاقچه با ناشران ارتباط می‌گیریم و ابزارهایی در اختیارشان
            می‌گذاریم که بتوانند محتوای خود را در اختیار مخاطبان بیشتری بگذارند،
            گزارش‌های متنوعی از عرضهٔ محتوای خود به‌دست بیاورند و… بنابراین به
            ناشر کمک می‌کنیم که کمتر دربارهٔ فروش و بازاریابی کتاب خود دغدغه
            داشته باشد و بیشتر بر تولید محتوای باکیفیت متمرکز شود. محتوایی که
            ناشران عرضه می‌کنند، نیازمند بهینه‌سازی‌های دیجیتالی است تا با کیفیت
            بهتری در اختیار مخاطب قرار بگیرد. این کار تماماً برعهدهٔ طاقچه است.
            پس از آنکه کتاب‌ها و نشریات به‌خوبی بر طاقچه قرار گرفتند، تلاش
            می‌کنیم آنها را به‌دست کاربران برسانیم. با همین هدف، همیشه پویش‌های
            مختلف و تخفیف‌های متنوعی در طاقچه عرضه می‌شود. در کنار آنها، تلاش
            می‌کنیم محتوایی که به دست مخاطب می‌رسد، خوب و آسان خوانده شود.
            بنابراین بر کنش مطالعه و بهبود تجربۀ خواندن و شنیدن، تمرکز کرده‌ایم.
            حتماً وقتی به یک کتابفروشی در شهر خود سر می‌زنید، دوست دارید یا
            ویترین جذاب و به‌روزی ببینید یا از آن بهتر، با کتابفروش کتاب‌خوانی
            هم‌صحبت شوید که بر اساس علایق و سلایق شما کتابی به شما معرفی کند.
            حالا که به طاقچه سر می‌زنید، طاقچه باید جای خالی این ویترین و آن
            کتابفروش ماهر را پر کند. یکی از وظایف طاقچه آن است که با استفادۀ از
            سازوکارهای ماشینی و هوش مصنوعی، کتاب‌های موردعلاقۀ شما را بشناسد و
            بر اساس آنها، پیشنهادی دلخواه شما بدهد. در طاقچه سامانه‌ای به
            نام«گلدون»مسئولیت تنظیم چنین پیشنهادهایی را برعهده دارد. البته پس از
            کار با طاقچه، هیچ‌وقت تنها نمی‌مانید. اگر سؤالی یا مشکلی پیش بیاید،
            می‌توانید به‌راحتی با پشتیبانی طاقچه ارتباط بگیرید.
          </text>
        </div>
      </div>
    </>
  );
};

export default page;
